<script setup>
const list = [
  { name: 'Антицеллюлитный', desc: 'разбивает жировые отложения, активизирует выработку коллагена и эластина, повышает тонус мышц' },
  { name: 'Лимфодренажный', desc: 'убирает отёки, выводит лишнюю жидкость и токсины из организма' },
  { name: 'Расслабляющий', desc: 'снимает напряжение в мышцах, суставах, уменьшение болевых ощущений' },
  { name: 'Силовой', desc: 'елакс: ускоряет и активизирует три важных компонента для осуществления работы организма человека: кровь, кислород и лимфу' },
  { name: 'Проминающий', desc: 'снимает болезненные ощущения, вызванные перенапряжением мышц, спазмами или застойными явлениями' },
]

</script>

<template>
  <div class="text-sm flex flex-col gap-5">
    <p><b class="font-bold">Сертифицированный</b> мастер массажа Профстудии НИКОЛЕ - <b class="font-bold">Карина</b>.</p>

    <p>Фея красоты и упругости вашей кожи, здоровой спины и расслабления.</p>

    <p>Девиз, которым руководствуется Карина: "Вы не сможете купить счастье, но Вы можете сходить на массаж - это тоже
      самое".</p>

    <p>Именно желание помогать людям укрепить здоровье, улучшить настроение, скорректировать фигуру, сподвигло Карину
      обучиться массажу и исполнить свою детскую мечту.</p>

    <p>В копилке нашего мастера различные виды техник:</p>

    <ul>
      <li v-for="item in list" class="mb-1">
        <List class="w-3 h-3 mb-1 fill-secondary inline-block mr-1" />
        <span class="font-medium text-base">{{ item.name }}:</span> {{ item.desc }}
      </li>
    </ul>

    <p><b class="font-bold">Массаж лица</b> помогает расслабить мышцы, избавиться от морщин и даже снять головные боли,
      так как снимаются
      мышечные блоки.</p>

    <p>В нашей студии мы практикуем:</p>

    <ul>
      <li v-for="item in list2" class="mb-1">
        <List class="w-3 h-3 mb-1 fill-secondary inline-block mr-1" />
        <span class="font-medium text-base">{{ item.name }}:</span> {{ item.desc }}
      </li>
    </ul>
  </div>
</template>
