<script setup>
const list = [
  'Соблюдение всех нормативных правил стерильности',
  'Индивидуальная работа с КАЖДЫМ клиентом. Эскиз, подбор формы/ пигмента исходя из Вашего строения лица',
  'Правильное и качественное проведение процедуры ПМ',
  'Грамотное перекрытие старого ПМ, если это возможно. Если невозможно, то четкие рекомендации по дальнейшим действиям',
]
</script>

<template>
  <div class="text-sm flex flex-col gap-5">
    <p><b class="font-bold">Наталья</b> - сертифицированный мастер перманентного макияжа Профстудии НИКОЛЕ.</p>

    <p>История Натальи на все 100 доказывает, что главное в работе - это <b class="font-bold">ответственность и
        профессионализм</b> мастера.</p>

    <p>Наталью никогда не привлекал косметический татуаж, а наоборот вызывал отвращение и страх.</p>

    <p>Всё потому что на своём пути она встречала неудачные примеры перманентного макияжа.</p>

    <p>Плотно забитые сине-зелёные брови, ярко-выделяющиеся губы, которые выбегают за естественный контур и уплывшие в
      далёкое
      плаванье синие стрелки. Такой результат Наталья наблюдала у знакомых, а также просто проходящих мимо девушек и
      женщин.</p>

    <p>Но наткнувшись в социальных сетях на красивые работы мастера по ПМ, Наталья рискнула и записалась на перманент
      бровей.</p>

    <p>Результат её поразил! Она не предполагала, что перманент может выглядеть так <b class="font-bold">красиво,
        аккуратно и самое главное
        натурально!</b></p>

    <p>С того самого времени Наталья решила стать мастером перманентного макияжа.</p>

    <p>Она прошла множество обучений, мастер классов, семинаров и постоянно повышает свою квалификацию.</p>

    <p>За <b class="font-bold">5 лет</b> непрерывной работы проделала большой путь мастера ПМ и многочисленные благодарные
      клиенты тому
      подтверждение.</p>

    <p>Главные принципы Натальи в работе:</p>

    <ul>
      <li v-for="item in list" class="font-medium mb-2">
        <List class="w-3 h-3 mb-1 fill-secondary inline-block mr-1" />
        {{ item }}
      </li>
    </ul>
  </div>
</template>

