<script setup>
const list = [
  'Беременность и депиляция',
  'Профессиональное лечение вросших волос',
  'Магия ваксинга',
  'Спа уходы в салоне красоты',
  'Классический массаж лица, массаж-уход для лица',
]
</script>

<template>
  <div class="text-sm flex flex-col gap-5">
    <p><b class="font-bold">Ольга</b> - сертифицированный ТОП мастер депиляции профстудии НИКОЛЕ.</p>

    <p>Целых <b class="font-bold">11 лет</b> Ольга причастна к улыбкам на лицах и к сверкающим глазам прекрасных дам. А
      все потому, что она
      помогает
      им быть не только красивыми, но и уверенными в себе.</p>

    <p>Её карьера началась в далёком <b class="font-bold">2012</b> году, когда она окончила свои первые курсы по шугарингу
      и стала заниматься
      сахарной депиляцией.</p>

    <p>В скором времени Ольга прошла <b class="font-bold">курсы повышения квалификации</b>. Стала "Мастером SPA шугаринга"
      и продолжила трудиться с
      удвоенной силой.</p>

    <p>В <b class="font-bold">2015</b> году прошла ещё <b class="font-bold">4 повышения</b> своего мастерства и одним из
      них стало "Маэстро шугаринга".</p>

    <p>Думаете на этом Ольга остановилась? Ну конечно же нет. В её арсенале очень много обучений:</p>

    <ul>
      <li v-for="item in list" class="font-medium text-base">
        <List class="w-3 h-3 mb-1 fill-secondary inline-block mr-1" />
        {{ item }}
      </li>
    </ul>

    <p>В <b class="font-bold">2019</b> году прошла <b class="font-bold">обучение по электроэпиляции</b> в медицинском
      центре "Деметра" в г.
      Санкт-Петербург. Успешно
      работает
      электрологом.
      Ведет преподавательскую деятельность. <b class="font-bold">Имеет диплом о профессиональной переподготовке</b> по
      квалификации" Преподаватель
      депиляции".</p>

    <p>Её цель - быть профессионалом в своём деле и радовать клиентов безопасной и качественной процедурой.</p>
  </div>
</template>
