<script setup>
const servicesImgs = import.meta.globEager('@/assets/img/services/*.png');
const mastersImgs = import.meta.globEager('@/assets/img/masters/*.jpg');
const specializations = {
  1: [
    { name: 'Голени/бедра', price: 1400 },
    { name: 'Глубокое бикини', price: 1600 },
    { name: 'Подмышки', price: 600 },
    { name: 'Лицо(1 зона)', price: 450 },
    { name: 'Лицо полностью', price: 1000 },
    { name: 'Руки(до локтя)', price: 800 },
    { name: 'Руки полностью', price: 1100 },
    { name: 'Ягодицы', price: 700 },
    { name: 'Живот полностью', price: 500 },
    { name: 'Голени/подмышки/ бикини', price: 2700 },
    { name: 'Ноги/бикини/подмышки', price: 3500 },
    { name: 'Ноги/бикини/подмышки/руки', price: 4300 },
  ],
  2: [
    { name: 'Грудь + живот', price: 2000 },
    { name: 'Зона паха', price: 2700 },
    { name: 'Ноги полностью', price: 2800 },
    { name: 'Окантовка шеи', price: 800 },
    { name: 'Плечи', price: 800 },
    { name: 'Подмышки', price: 700 },
    { name: 'Руки полностью', price: 1800 },
    { name: 'Спина вместе с плечами', price: 2000 },
  ],
  3: [
    { name: 'Подмышки, руки, ноги', price: 38, post: 'р/мин' },
    { name: 'Лицо, бикини', price: 45, post: 'р/мин' },
  ],
  9: [
    { name: 'Волосковая техника', price: 9000 },
    { name: 'Теневая техника', price: 9000 },
    { name: 'Коррекция', price: 5500 },

  ],
  10: [
    { name: 'Межресничная стрелка', price: 7000 },
    { name: 'Классическая стрелка', price: 9000 },
    { name: 'Стрелка с растушевкой (теневая)', price: 9000 },
    { name: 'Коррекция', price: 5500 },
  ],
  11: [
    { name: 'Акварельный прокрас', price: 9000 },
    { name: 'Помадный прокрас', price: 9000 },
    { name: 'Коррекция', price: 5500 },
  ],
  4: [
    { name: '30 минут', price: 1600 },
    { name: '60 минут', price: 2400 },
  ],
  5: [
    { name: '30 минут', price: 1600 },
    { name: '60 минут', price: 2400 },
    { name: '90 минут', price: 3200 },
    { name: '120 минут', price: 4200 },
  ],
  6: [
    { name: '30 минут', price: 1600 },
    { name: '60 минут', price: 2400 },
    { name: '90 минут', price: 3200 },
    { name: '120 минут', price: 4200 },
  ],
  7: [
    { name: '30 минут', price: 1600 },
    { name: '60 минут', price: 2400 },
    { name: '90 минут', price: 3200 },
    { name: '120 минут', price: 4200 },
  ],
  8: [
    { name: '30 минут', price: 1600 },
    { name: '60 минут', price: 2400 },
  ]
}

const masters = ref([
  {
    ref: 'olga',
    name: "Ольга",
    specialization: 'Мастер депиляции',
    imgMaster: mastersImgs['/assets/img/masters/Olga.jpg'].default,
    img: servicesImgs['/assets/img/services/депиляция.png'].default,
    description: `
      Ольга - сертифицированный ТОП мастер депиляции профстудии НИКОЛЕ.

      <br><br>Целых 11 лет Ольга причастна к улыбкам на лицах и к сверкающим глазам прекрасных дам. А все потому, что она помогает им быть не только красивыми, но и уверенными в себе.

      <br><br>Её карьера началась в далёком 2012 году, когда она окончила свои первые курсы по шугарингу и стала заниматься сахарной депиляцией.

      <br><br>В скором времени Ольга прошла курсы повышения квалификации. Стала "Мастером SPA шугаринга" и продолжила трудиться с удвоенной силой.

      <br><br>В 2015 году прошла ещё 4 повышения своего мастерства и одним из них стало "Маэстро шугаринга".

      <br><br>Думаете на этом Ольга остановилась? Ну конечно же нет. В её арсенале очень много обучений:
      <ul>
        <li>🔸"Беременность и депиляция";</li>
        <li>🔸"Профессиональное лечение вросших волос";</li>
        <li>🔸"Магия ваксинга";</li>
        <li>🔸"Спа уходы в салоне красоты";</li>
        <li>🔸"Классический массаж лица, массаж-уход для лица".</li>
      <ul/>

      <br><br>В 2019 году прошла обучение по электроэпиляции в медицинском центре "Деметра" в г. Санкт-Петербург. Успешно работает электрологом.
      Ведет преподавательскую деятельность. Имеет диплом о профессиональной переподготовке по квалификации" Преподаватель депиляции".

      <br><br>Её цель - быть профессионалом в своём деле и радовать клиентов безопасной и качественной процедурой.
    `,
    services: [
      {
        name: "Депиляция",
        list: specializations['1'],
        opened: false,
      },
      {
        name: "Шугаринг (мужской)",
        list: specializations['2'],
        opened: false,
      },
      {
        name: "Электроэпиляция",
        list: specializations['3'],
        opened: false,
      },
    ],
  }, {
    ref: 'ksenia',
    name: "Ксения",
    specialization: 'Мастер перманентного макияжа',
    imgMaster: mastersImgs['/assets/img/masters/Ksenia.jpg'].default,
    img: servicesImgs['/assets/img/services/пм.png'].default,
    description: `
      Сертифицированный ТОП мастер по перманентному макияжу профстудии НИКОЛЕ - Ксения.

      <br><br>Имеет огромный опыт, более 5000 процедур, поэтому Вы можете ей доверять на все 100

      <br><br>Техники работы:
      <br><b>Брови:</b> пудровое напыление, плотный прокрас, градиент.

      <br><br>Также владеет волосковой техникой "Гиперреализм". Работает с алопецией (полное отсутствие бровей) женской, мужской и детской.

      <br><br><b>Веки:</b> межресничное пространство, элегантная стрелочка с растушевкой или без.
      <br><b>Губы:</b> акварельное напыление, помадный прокрас.

      <br><br>При необходимости осветление и очищение нежелательного перманента при помощи ремувера, без рубцов и других неприятностей.

      <br><br>Кроме волшебных рук и профессионализма имеется ряд заслуг:
      <ul>
        <li>🔸статус тренера по ПМ с сертификатом соответствия;</li>
        <li>🔸преподавательский опыт в области перманента и оформлению бровей более 2 лет;</li>
        <li>🔸автор собственных обучающих программ и методик по перманентному макияжу.</li>
      <ul/>

      <br><br>Активно принимает участие в
      международных конференциях, конгрессах и мастер-классах по ПМ. Коллекционирует сертификаты о повышении квалификации, их уже больше 50.

      <br><br>А ещё Ксения официальный представитель бренда "SL COLOR" г. СПБ пигменты и продукция для ПМ.

      <br><br>У Ксении нет шаблонных работ, но есть индивидуальный подход к каждому клиенту.
    `,
    services: [
      {
        name: "Перманентный макияж бровей",
        list: specializations['9'],
        opened: false,
      },
      {
        name: "Перманентный макияж век",
        list: specializations['10'],
        opened: false,
      },
      {
        name: "Перманентный макияж губ",
        list: specializations['11'],
        opened: false,
      },
    ],
  }, {
    ref: 'karina',
    name: "Карина",
    specialization: 'Мастер массажа',
    imgMaster: mastersImgs['/assets/img/masters/Karina.jpg'].default,
    img: servicesImgs['/assets/img/services/сила.png'].default,
    description: `
      Сертифицированный мастер массажа Профстудии НИКОЛЕ - Карина.
      <br><br>Фея красоты и упругости вашей кожи, здоровой спины и расслабления.

      <br><br>Девиз, которым руководствуется Карина: "Вы не сможете купить счастье, но Вы можете сходить на массаж - это тоже самое".

      <br><br>Именно желание помогать людям укрепить здоровье, улучшить настроение, скорректировать фигуру, сподвигло Карину обучиться массажу и исполнить свою детскую мечту.

      <br><br>В копилке нашего мастера различные виды техник:
      <ul>
        <li>🔸Антицеллюлитный: разбивает жировые отложения, активизирует выработку коллагена и эластина, повышает тонус мышц.</li>
        <li>🔸Лимфодренажный: убирает отёки, выводит лишнюю жидкость и токсины из организма.</li>
        <li>🔸Расслабляющий: снимает напряжение в мышцах, суставах, уменьшение болевых ощущений.\</li>
        <li>🔸Силовой релакс: ускоряет и активизирует три важных компонента для осуществления работы организма человека: кровь, кислород и лимфу.</li>
        <li>🔸Проминающий: снимает болезненные ощущения, вызванные перенапряжением мышц, спазмами или застойными явлениями.</li>
      <ul/>

      <br>❗Массаж лица помогает расслабить мышцы, избавиться от морщин и даже снять головные боли, так как снимаются мышечные блоки.

      <br><br>В нашей студии мы практикуем:
      <ul>
        <li>🔸Японский массаж (кобидо): отлично влияет на состояние кожи, улучшает кровообращение. Захватывает не только лицо, но и зону декольте.</li>
        <li>🔸Пластический: позволяет размять мышцы и не даёт им снова стянуть кожу в морщинки.</li>
      <ul/>
    `,
    services: [
      {
        name: "Хиропластический массаж",
        list: specializations['4'],
        opened: false,
      },
      {
        name: "Антицеллюлитный массаж",
        list: specializations['5'],
        opened: false,
      },
      {
        name: "Силовой релакс",
        list: specializations['6'],
        opened: false,
      },
      {
        name: "Лимфодренажный массаж",
        list: specializations['7'],
        opened: false,
      },
      {
        name: "Японский массаж (кобидо)",
        list: specializations['8'],
        opened: false,
      },
    ],
  }, {
    ref: 'natalia',
    name: "Наталия",
    specialization: 'Мастер перманентного макияжа',
    imgMaster: mastersImgs['/assets/img/masters/Natalia.jpg'].default,
    img: servicesImgs['/assets/img/services/пм.png'].default,
    description: `
      Наталья - сертифицированный мастер перманентного макияжа Профстудии НИКОЛЕ.<br><br>

      История Натальи на все 100 доказывает, что главное в работе - это ответственность и профессионализм мастера.<br><br>

      Наталью никогда не привлекал косметический татуаж, а наоборот вызывал отвращение и страх.<br>
      Всё потому что на своём пути она встречала неудачные примеры перманентного макияжа.<br><br>

      Плотно забитые сине-зелёные брови, ярко-выделяющиеся губы, которые выбегают за естественный контур и уплывшие в далёкое плаванье синие стрелки. Такой результат Наталья наблюдала у знакомых, а также просто проходящих мимо девушек и женщин.<br><br>

      Но наткнувшись в социальных сетях на красивые работы мастера по ПМ, Наталья рискнула и записалась на перманент бровей.<br><br>

      Результат её поразил! Она не предполагала, что перманент может выглядеть так красиво, аккуратно и самое главное натурально!<br><br>

      С того самого времени Наталья решила стать мастером перманентного макияжа.<br><br>

      Она прошла множество обучений, мастер классов, семинаров и постоянно повышает свою квалификацию.<br><br>

      За 5 лет непрерывной работы проделала большой путь мастера ПМ и многочисленные благодарные клиенты тому подтверждение.<br><br>

      Главные принципы Натальи в работе:<br>
      <ul>
        <li>🔸Соблюдение всех нормативных правил стерильности;</li>
        <li>🔸Индивидуальная работа с КАЖДЫМ клиентом. Эскиз, подбор формы/ пигмента исходя из Вашего строения лица;</li>
        <li>🔸Правильное и качественное проведение процедуры ПМ;</li>
        <li>🔸Грамотное перекрытие старого ПМ, если это возможно. Если невозможно, то четкие рекомендации по дальнейшим действиям.</li>
      <ul/>
    `,
    services: [
      {
        name: "Перманентный макияж бровей",
        list: specializations['9'],
        opened: false,
      },
      {
        name: "Перманентный макияж век",
        list: specializations['10'],
        opened: false,
      },
      {
        name: "Перманентный макияж губ",
        list: specializations['11'],
        opened: false,
      },
    ],
  }
]
)
const contact = ref(null)
const olga = ref(null)
const ksenia = ref(null)
const natalia = ref(null)
const karina = ref(null)
const masterRefs = {
  olga, ksenia, natalia, karina
}
const scrollToRef = (html) => {
  html.scrollIntoView({ behavior: 'smooth' });
}
const scrollFromReview = (masterName) => {
  scrollToRef(masterRefs[masterName].value[0])
}
</script>

<template>
  <HeroSection @scroll="scrollToRef(contact)" />
  <AboutUs />
  <Reviews @scroll="scrollFromReview($event)" />
  <template v-for="master in masters">
    <div :ref="master.ref"></div>
    <Services @scroll="scrollToRef(master.ref)" :master="master" />
  </template>
  <div ref="contact"></div>
  <Contacts />
  <ClientOnly>
    <Map></Map>
  </ClientOnly>
</template>

<style lang="postcss" scoped></style>
